let males = [
    "Павлов Антон Григорьевич",
    "Устинов Панкратий Натанович",
    "Мамонтов Семен Христофорович",
    "Воронцов Ким Авдеевич",
    "Медведев Оскар Михайлович",
    "Зыков Роберт Арсеньевич",
    "Бирюков Велорий Артёмович",
    "Самсонов Артур Германович",
    "Попов Клемент Глебович",
    "Павлов Артем Геннадьевич"
]

let females = [
    "Щербакова Эмилия Михаиловна",
    "Фадеева Зара Пётровна",
    "Брагина Алина Агафоновна",
    "Лаврентьева Милиса Улебовна",
    "Логинова Нора Валерьевна",
    "Маркова Альжбета Германовна",
    "Гусева Мэри Яковлевна", 
    "Пахомова Риана Авксентьевна",
    "Антонова Дарьяна Павловна",
    "Громова Снежана Адольфовна"
]

let dates = [
    "2021-04-06T16:40:57.170Z", "2020-09-23T02:08:13.560Z", "2017-02-22T08:24:45.048Z", "2012-05-24T04:33:34.118Z", "2012-11-28T22:37:13.243Z", "2016-12-25T16:55:51.097Z", "2014-03-25T15:56:15.551Z", "2016-05-07T22:58:14.840Z", "2012-03-17T05:51:11.025Z", "2017-03-24T08:26:44.308Z", "2014-10-13T16:52:40.148Z", "2015-07-13T01:28:21.952Z", "2018-12-03T15:38:21.176Z", "2013-03-19T10:23:11.027Z", "2019-03-28T09:33:07.426Z", "2012-07-23T19:21:29.532Z", "2015-03-08T00:09:04.683Z", "2013-02-10T20:23:21.848Z", "2013-11-04T19:45:40.703Z", "2012-08-12T03:57:24.592Z"
]

function init() {
    const malesDto = males.map((m, i) => {
        return {
            name: m.split(' ')[1],
            surname: m.split(' ')[0],
            patronymic: m.split(' ')[2],
            dateBirth: dates[i],
            gender: 'Мужской'
        }
    })

    const femalesDto = females.map((m, i) => {
        return {
            name: m.split(' ')[1],
            surname: m.split(' ')[0],
            patronymic: m.split(' ')[2],
            dateBirth: dates[i],
            gender: 'Женский'
        }
    })

    console.log(JSON.stringify([...malesDto, ...femalesDto].sort(() => .5 - Math.random())));
}

init();